import streamlit as st

def run():
    st.title("東方LW ダメージ計算機")
    st.write("by オマーン国際空港")
    st.write("最終更新日: 2026/10/27 ")

    st.write("================================")
    st.write("・実機で試したほうが大抵速いです。")
    st.write("・全弾CRI前提の最大ダメージに加え、弾性弾などを考慮したCRI命中率で重みづけした期待値、CRI命中率が100%でないバレットにおいてCRIが発生しないとした最低値も同時に計算します。")
    st.write("・バレットのヒット順が絡む条件、例えば攻撃中に敵がfullbreakする、バレット内効果でバフデバフが入る、などには対応していません。特に、敵の結界異常枚数はうまく設定してください。")
    st.write("・敵の永続効果により、敵の能力欄自体が書き換わっている場合は入力に気を付けてください。")
    st.write("・最終の計算結果のみ小数点以下を切り捨てているため、実機とは少しずれた値が出力されます。")
    st.write("・17:55~18:00の間にサイトを更新するのでこの時間は使用を控えてください。")
    st.write("================================")